tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
void IrrigationApp::afterFormatFs(const Esp32BaseWeb::FormatFsResult& result, void* user) {
    if (user) {
        static_cast<IrrigationApp*>(user)->handleAfterFormatFs(result);
    }
}

void IrrigationApp::handleAfterFormatFs(const Esp32BaseWeb::FormatFsResult& result) {
    BoardHardware& hardware = BoardHardware::instance();
    wateringController_.abortForMaintenance(millis());
    hardware.safeShutdown();
    businessReady_ = false;

    if (!result.mountSuccess) {
        recordStorageFault_ = true;
        eventStorageFault_ = true;
        return;
    }

    bool configReady = configStore_.begin();
    if (configReady) configReady = applyStoredParameterConfig();
    const IrrigationConfig* config = configStore_.current();
    const bool pwmReady = configReady && config &&
                          hardware.configureValvePwmFrequency(
                              config->valveDrive.pwmFrequencyHz);
    const bool schedulerCleared = wateringSchedulerStore_.clear();
    const bool schedulerLoaded = wateringScheduler_.begin(wateringSchedulerStore_);
    const bool schedulerReady = schedulerCleared && schedulerLoaded;
    if (!schedulerReady) {
        wateringScheduler_.disable();
    }
    const bool checkpointReady = aliveCheckpoint_.begin();
    schedulerStorageFault_ = !schedulerReady;
    Esp32BaseRecordStore::StoreStatus recordStatus{};
    const bool recordStatusReady = wateringRecordStore_.readStatus(recordStatus);
    const bool recordsReady = wateringRecordStoreRegistered_ &&
                              result.businessRecordStoresReloadSuccess &&
                              recordStatusReady &&
                              recordStatus.state == Esp32BaseRecordStore::StoreState::Ready;
    eventStorageFault_ = !Esp32BaseAppEvents::isEventStoreReady();
    recordStorageFault_ = !recordsReady;
    if (!recordsReady) {
        reportRecordStorageFault(IrrigationEvents::ReasonCode::RecordStoreAfterFormat);
    }
    businessReady_ = configReady && pwmReady;
    if (businessReady_) {
        resetUnexpectedFlowMonitor(millis());
    }
    if (!businessReady_) {
        hardware.safeShutdown();
    }
    ESP32BASE_LOG_W("irrigation",
                    "after_format_reinitialized business_ready=%s records_ready=%s scheduler_ready=%s checkpoint_ready=%s",
                    businessReady_ ? "yes" : "no",
                    recordsReady ? "yes" : "no",
                    schedulerReady ? "yes" : "no",
                    checkpointReady ? "yes" : "no");
}
